WELCOME_STICKER = 'CAACAgIAAxkBAU0w0mYWtHnC-TwVZCJ4qpIb780YyrlVAAIpAQACFkJrCqxwmND03X3YNAQ'
WELCOME_MESSAGE = ('<b>Привет!</b>\n\n'
                   'Я твой личный помощник по выгодным покупкам 🛍️.\nС моей помощью ты сможешь следить за ценами товаров на <b>Яндекс Маркете</b> и <b>Wildberries</b> 📊.\n\n'
                   'Забудь о долгих поисках и сравнениях цен - просто нажми на кнопку "🔍 Поиск"  и наслаждайся выгодными покупками!\n\n'
                   '<b>Готов сэкономить?</b> Давай начнем! 💸')
SUPPORT_MESSAGE = "Если возникли ошибки или что-то не работает, пожалуйста, напишите в наш чат поддержки: @bot_support_ru_marketplaces 📩."
WAITING_MESSAGE = '⏳ Это займет какое-то время'
FAILED_MESSAGE = '❌ Не удалось получить информацию о товаре. Возможные ошибки: капча, товар закончился или был удалён'

SEARCH_BTN = '🔍 Поиск'
SUPPORT_BTN = '💬 Поддержка'
MENU_PLACEHOLDER = 'Выбери пункт меню'
UNKNOWN_CMD = f'📍 Неверная команда, чтобы продолжить нажми кнопку {SEARCH_BTN}'
UNKNOWN_URL = f'📍 Неверная ссылка. Поддерживаются только <b>wildberries.ru</b> и <b>market.yandex.ru</b>'
